## 排序和排名

In [8]:
import pandas as pd
import numpy as np

In [9]:
obj = pd.Series(range(4),index=['d','a','c','b'])
obj

d    0
a    1
c    2
b    3
dtype: int64

In [10]:
obj.sort_index()

a    1
b    3
c    2
d    0
dtype: int64

In [11]:
# 按照轴索引排序：sort_index()

In [12]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','two'],columns=['d','a','c','b'])
frame

       d  a  c  b
three  0  1  2  3
two    4  5  6  7

In [14]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  3  2  0
two    5  7  6  4

In [17]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  2  3  1
two    4  6  7  5

In [18]:
#按值进行排序: sort_values()

In [22]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [23]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [24]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [27]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [29]:
frame.sort_values(by=['b'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [31]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [35]:
#排名，默认情况下rank使用的method为average

In [37]:
obj = pd.Series([7,-5,7,4,2,0,4])
obj.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [38]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [40]:
obj.rank(method='first')  #排序后按照出现顺序的rank

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [41]:
obj.rank(method='max')  #出现并列的情况下，按照最大值排名

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [42]:
obj.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [44]:
obj.rank(method='dense')  #两个人并列第一，下一个第二

0    5.0
1    1.0
2    5.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [45]:
data = pd.DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [48]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0